<a href="https://colab.research.google.com/github/JunoJames-JJ/AI-ML-Learning/blob/main/Lab_2_Data_Mining_with_Relational_Database_(2).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##### Objective  
> Apply relational datamining techniques in Python using sqlite3

> Explore additional relational data mining library in Python

### What is Relational Data Mining?    
Relational data mining is a technique used to analyze data that is stored in multiple related tables or datasets.  
By identifying relationships between these tables, we can uncover insights that may not be immediately obvious from a single table.  
For example, by analyzing customer purchase history and demographic data, we can identify patterns in buying behavior that can inform marketing strategies.

#### Introduction to a simple client server database package -- SQLITE3  

Sqlite as the name suggests is light weight small, highly reliable, fast and self-contained, serverless (traditional databases have seperate server and client processes - not sqlite - it is contained in a single file) SQL database engine.   
It is the msost preferred database engine for all the mobile applications  
It is stable (hence widely used), platform indpendent (32/64 bits), and backward compatible

In [1]:
#!pip install pandas

In [2]:
import sqlite3
import pandas as pd

# Create a sample database if it does not already exists

In [3]:
conn = sqlite3.connect('lab2.db') ### create connection to the database

print("Opened database successfully")

Opened database successfully

### Create a table "Company with corresponding field values and thier data types

In [4]:
conn.execute('''CREATE TABLE COMPANY
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);''')


conn.close()

#### Insert Data into the table created above

In [5]:
conn = sqlite3.connect('lab2.db')
print("Opened database successfully")

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (1, 'Paul', 32, 'California', 20000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (2, 'Allen', 25, 'Texas', 15000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

conn.commit()
print("Records created successfully")
conn.close()
print("Connection Closed successfully")

Opened database successfully
Records created successfully
Connection Closed successfully

#### Read the table you just created (SQL & PYTHON way)

In [6]:
conn = sqlite3.connect('lab2.db')
cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
    print("ID = ", row[0])
    print("NAME = ", row[1])
    print( "ADDRESS = ", row[2])
    print( "SALARY = ", row[3], "\n")

print("Operation completed successfully")
print("We will not close the connection yet, so we can read the data using pandas method")
#conn.close()

ID =  1
NAME =  Paul
ADDRESS =  California
SALARY =  20000.0

ID =  2
NAME =  Allen
ADDRESS =  Texas
SALARY =  15000.0

ID =  3
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

Operation completed successfully
We will not close the connection yet, so we can read the data using pandas method

In [7]:
#Pandas method to read database
df=pd.read_sql_query('Select id, name, address, salary from COMPANY', conn)
df

   ID   NAME     ADDRESS   SALARY
0   1   Paul  California  20000.0
1   2  Allen       Texas  15000.0
2   3  Teddy      Norway  20000.0
3   4   Mark  Rich-Mond   65000.0

#### Descriptive Statistics of SALARY (SQL & PYTHON way)

In [8]:
#Python Way for getting descriptive statististics
df.SALARY.describe()

count        4.000000
mean     30000.000000
std      23452.078799
min      15000.000000
25%      18750.000000
50%      20000.000000
75%      31250.000000
max      65000.000000
Name: SALARY, dtype: float64

In [9]:
# SQL Queries to calculate descriptive statistics values
import numpy as np
# Count
cursor.execute('SELECT COUNT(SALARY) FROM COMPANY')
count = cursor.fetchone()[0]

# Mean
cursor.execute('SELECT AVG(SALARY) FROM COMPANY')
mean = cursor.fetchone()[0]

# Variance
cursor.execute('''
    SELECT AVG((SALARY - (SELECT AVG(SALARY) FROM COMPANY)) * (SALARY - (SELECT AVG(SALARY) FROM COMPANY))) AS variance
    FROM COMPANY
''')
variance = cursor.fetchone()[0]
std_dev = np.sqrt(variance)

# Min
cursor.execute('SELECT MIN(SALARY) FROM COMPANY')
min_age = cursor.fetchone()[0]

# Max
cursor.execute('SELECT MAX(SALARY) FROM COMPANY')
max_age = cursor.fetchone()[0]

# Display results
print("\nDescriptive statistics using SQL:")
print(f"Count: {count}")
print(f"Mean: {mean}")
print(f"Standard Deviation: {std_dev}")
print(f"Min: {min_age}")
print(f"Max: {max_age}")

# Close the connection
conn.close()

Descriptive statistics using SQL:
Count: 4
Mean: 30000.0
Standard Deviation: 20310.0960115899
Min: 15000.0
Max: 65000.0

As you see above I stopped after min / max since it is cumbersome.

#### Update values in the newly created table (only exploring the SQL way from this point onwards)

In [10]:
conn = sqlite3.connect('lab2.db')
print("Opened database successfully")

conn.execute("UPDATE COMPANY set SALARY = 150000.00 where ID = 1")
conn.commit()
print( "Total number of rows updated :", conn.total_changes)

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
    print("ID = ", row[0])
    print("NAME = ", row[1])
    print( "ADDRESS = ", row[2])
    print( "SALARY = ", row[3], "\n")

print("Operation completed successfully")
conn.close()

Opened database successfully
Total number of rows updated : 1
ID =  1
NAME =  Paul
ADDRESS =  California
SALARY =  150000.0

ID =  2
NAME =  Allen
ADDRESS =  Texas
SALARY =  15000.0

ID =  3
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

Operation completed successfully

#### Delete values from the table

In [11]:
conn = sqlite3.connect('lab2.db')
#print("Opened database successfully")

conn.execute("DELETE from COMPANY where ID = 2;")
conn.commit()
print( "Total number of rows deleted :", conn.total_changes)

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
    print("ID = ", row[0])
    print("NAME = ", row[1])
    print( "ADDRESS = ", row[2])
    print( "SALARY = ", row[3], "\n")

print("Operation completed successfully")
conn.close()
print("Connection Closed")

Total number of rows deleted : 1
ID =  1
NAME =  Paul
ADDRESS =  California
SALARY =  150000.0

ID =  3
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

Operation completed successfully
Connection Closed

#### Delete an entire table

In [12]:
conn = sqlite3.connect('lab2.db')
conn.execute("DROP TABLE COMPANY;")

#### Check if table is deleted from the database

In [13]:
sql_query = """SELECT name FROM sqlite_master
  WHERE type='table';"""

conn.execute(sql_query)
cursor=conn.cursor()
print(cursor.fetchall())
conn.close()

[]

### Practice Creating the table and then review the list of tables from the database using try catch method

In [14]:
conn = sqlite3.connect('DropTest.db') ### create connection to the database

print("Opened database successfully")

Opened database successfully

In [17]:
conn = sqlite3.connect('DropTest.db')
print("Opened database successfully")

try:
  conn.execute("DROP TABLE IF EXISTS DROPTEST;")
  print("Drop Table dropped... ")
except:
  print("Error in dropping table")

Opened database successfully
Drop Table dropped...

In [18]:
conn.execute('''CREATE TABLE DROPTEST
         (ID INT PRIMARY KEY     NOT NULL,
         FIRST_NAME           TEXT    NOT NULL,
         LAST_NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);''')


conn.close()

In [19]:
conn = sqlite3.connect('DropTest.db')
#print "Opened database successfully";

conn.execute("INSERT INTO DROPTEST (ID,FIRST_NAME,LAST_NAME,AGE,ADDRESS,SALARY) \
      VALUES (1, 'Paul', 'Watson',32, 'Houston', 25000.00 )");

conn.execute("INSERT INTO DROPTEST (ID,FIRST_NAME,LAST_NAME,AGE,ADDRESS,SALARY) \
      VALUES (2, 'Allen', 'Dobbin',25, 'Texas', 15000.00 )");

conn.execute("INSERT INTO DROPTEST (ID,FIRST_NAME,LAST_NAME,AGE,ADDRESS,SALARY) \
      VALUES (3, 'Teddy', 'Sutherland',23, 'Norway', 20000.00 )");

conn.execute("INSERT INTO DROPTEST (ID,FIRST_NAME,LAST_NAME,AGE,ADDRESS,SALARY) \
      VALUES (4, 'Mark', 'Meldrum', 25, 'Rich-Mond ', 65000.00 )");

conn.execute("INSERT INTO DROPTEST (ID,FIRST_NAME,LAST_NAME,AGE,ADDRESS,SALARY) \
      VALUES (5, 'Paula', 'Henderson',32, 'California', 41000.00 )");


conn.commit()
#print "Records created successfully";
conn.close()

##### Reflection Task: (5 points)
1. Add 10 more values to the above database and display the output sorted by LAST_NAME in descending order.(2 points)
2. Find the MAX & Average Salary grouped by age and display the output (refer to lecture slide 18 for expected output for this task).  (2 points)
3. Research and summarize, as to why do we need to use conn.close() after each data manipulation exercise with sql? (1 point)

##### Review the list of tables from the database using try catch method

In [20]:
try:

    # Making a connection between sqlite3, database and Python Program and print success
    sqliteConnection = sqlite3.connect('DropTest.db')

    print("Connected to SQLite")

    # Retrieve all tables from sqlite_master
    sql_query = """SELECT name FROM sqlite_master
    WHERE type='table';"""

    # Create a cursor object using connection object and execute teh query to retrieve the tables
    cursor = sqliteConnection.cursor()

    cursor.execute(sql_query)
    print("List of tables\n")

    print(cursor.fetchall())

except sqlite3.Error as error:
    print("Failed to execute the above query", error)

finally:

    # If connection is open, we need to close it
    if sqliteConnection:

        # use close() method, we will close the connection
        sqliteConnection.close()
        print("the sqlite connection is closed")

Connected to SQLite
List of tables

[('DROPTEST',)]
the sqlite connection is closed

# Reflection Tasks


1. Add 10 more values to the above database and display the output sorted by LAST_NAME in descending order.

In [21]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('DropTest.db')
print("Opened database successfully")

# adding 10 more values to the db:
conn.execute("INSERT INTO DROPTEST (ID,FIRST_NAME,LAST_NAME,AGE,ADDRESS,SALARY) \
      VALUES (6, 'Jack', 'Jill', 42, 'Chicago', 85000.00 )");
conn.execute("INSERT INTO DROPTEST (ID,FIRST_NAME,LAST_NAME,AGE,ADDRESS,SALARY) \
      VALUES (7, 'Mary', 'Jackson', 33, 'London', 95000.00 )");
conn.execute("INSERT INTO DROPTEST (ID,FIRST_NAME,LAST_NAME,AGE,ADDRESS,SALARY) \
      VALUES (8, 'Ann', 'Maria', 28, 'NorthBay', 15000.00 )");
conn.execute("INSERT INTO DROPTEST (ID,FIRST_NAME,LAST_NAME,AGE,ADDRESS,SALARY) \
      VALUES (9, 'Mathew', 'Fernad', 30, 'Toronto', 38000.00 )");
conn.execute("INSERT INTO DROPTEST (ID,FIRST_NAME,LAST_NAME,AGE,ADDRESS,SALARY) \
      VALUES (10, 'Juno', 'James', 28, 'Wheeling', 10000.00 )");
conn.execute("INSERT INTO DROPTEST (ID,FIRST_NAME,LAST_NAME,AGE,ADDRESS,SALARY) \
      VALUES (11, 'Joseph', 'Jo', 29, 'Chicago', 105000.00 )");
conn.execute("INSERT INTO DROPTEST (ID,FIRST_NAME,LAST_NAME,AGE,ADDRESS,SALARY) \
      VALUES (12, 'Matt', 'Demon', 55, 'Texas', 25000.00 )");
conn.execute("INSERT INTO DROPTEST (ID,FIRST_NAME,LAST_NAME,AGE,ADDRESS,SALARY) \
      VALUES (13, 'Mike', 'Brad', 45, 'Florida', 72000.00 )");
conn.execute("INSERT INTO DROPTEST (ID,FIRST_NAME,LAST_NAME,AGE,ADDRESS,SALARY) \
      VALUES (14, 'Iron', 'Man', 42, 'LA', 15000.00 )");
conn.execute("INSERT INTO DROPTEST (ID,FIRST_NAME,LAST_NAME,AGE,ADDRESS,SALARY) \
      VALUES (15, 'Hulk', 'Fav', 56, 'Vegas', 30000.00 )");

conn.commit()
print("Records created successfully")


# displaying the output sorted by LAST_NAME in descending order
df = pd.read_sql_query('SELECT * FROM DROPTEST ORDER BY LAST_NAME DESC', conn)
df

conn.close()
print("Connection Closed successfully")

Opened database successfully
Records created successfully
Connection Closed successfully

2. Find the MAX & Average Salary grouped by age and display the output (refer to lecture slide 18 for expected output for this task).

In [23]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('DropTest.db')

# query to get MAX and AVG salary grouped by Age
query = """SELECT AGE,
                    MAX(SALARY) AS MAX_SALARY,
                    AVG(SALARY) AS AVG_SALARY
              FROM DROPTEST
            GROUP BY AGE
            ORDER BY AGE;
        """

df_salary = pd.read_sql_query(query, conn)
df_salary

    AGE  MAX_SALARY  AVG_SALARY
0    23     20000.0     20000.0
1    25     65000.0     40000.0
2    28     15000.0     12500.0
3    29    105000.0    105000.0
4    30     38000.0     38000.0
5    32     41000.0     33000.0
6    33     95000.0     95000.0
7    42     85000.0     50000.0
8    45     72000.0     72000.0
9    55     25000.0     25000.0
10   56     30000.0     30000.0

In [24]:
conn.close()
print("Connection Closed successfully")

Connection Closed successfully

3. Research and summarize why we need to use conn.close() after each data manipulation exercise with SQL?

- We will be using conn.close() after insert, update, delete, create, etc., like after every data manipulation.
- And we need to terminate the connection to free up resources properly.
- We need to open DB connections as late as possible and always close them as early as possible, to prevent database locking issues.
- Also, when we close the connection, it makes sure that all transactions are correctly completed and saved.
- When we properly close the connection, it avoids unnecessary resource usage and improves efficiency.